; domain
(define (domain Mining)
(:requirements :typing :equality)
(:types place event)

(:predicates
(token ?p - place)
(tracePointer ?e - event)
(allowed)
)

(:functions
(total-cost)
)

(:action moveInTheModel#model_generated
:precondition (token p_5)
:effect (and (not (allowed)) (not (token p_5)) (token p_6) (increase (total-cost) 1)
)
)

(:action moveInTheModel#launch_algorithm
:precondition (token p_4)
:effect (and (not (allowed)) (not (token p_4)) (token p_5) (increase (total-cost) 1)
)
)

(:action moveInTheModel#restore_accessto_database
:precondition (token p_11)
:effect (and (not (allowed)) (not (token p_11)) (token p_12) (increase (total-cost) 1)
)
)

(:action moveSync#query#ev2
:precondition (and (token p_12) (tracePointer ev2))
:effect (and (allowed) (not (token p_12)) (token p_11) (not (tracePointer ev2)) (tracePointer ev3))
)

(:action moveSync#query#ev3
:precondition (and (token p_12) (tracePointer ev3))
:effect (and (allowed) (not (token p_12)) (token p_11) (not (tracePointer ev3)) (tracePointer ev4))
)

(:action moveInTheModel#query
:precondition (token p_12)
:effect (and (not (allowed)) (not (token p_12)) (token p_11) (increase (total-cost) 1)
)
)

(:action moveInTheModel#store_results
:precondition (token p_12)
:effect (and (not (allowed)) (not (token p_12)) (token p_14) (increase (total-cost) 1)
)
)

(:action moveSync#trasformation#ev4
:precondition (and (token p_14) (tracePointer ev4))
:effect (and (allowed) (not (token p_14)) (token p_15) (not (tracePointer ev4)) (tracePointer ev5))
)

(:action moveSync#trasformation#ev5
:precondition (and (token p_14) (tracePointer ev5))
:effect (and (allowed) (not (token p_14)) (token p_15) (not (tracePointer ev5)) (tracePointer ev6))
)

(:action moveInTheModel#trasformation
:precondition (token p_14)
:effect (and (not (allowed)) (not (token p_14)) (token p_15) (increase (total-cost) 1)
)
)

(:action moveSync#visualization#ev8
:precondition (and (token p_15) (tracePointer ev8))
:effect (and (allowed) (not (token p_15)) (token sink) (not (tracePointer ev8)) (tracePointer ev9))
)

(:action moveSync#visualization#ev9
:precondition (and (token p_15) (tracePointer ev9))
:effect (and (allowed) (not (token p_15)) (token sink) (not (tracePointer ev9)) (tracePointer ev10))
)

(:action moveInTheModel#visualization
:precondition (token p_15)
:effect (and (not (allowed)) (not (token p_15)) (token sink) (increase (total-cost) 1)
)
)

(:action moveSync#data_merge#ev6
:precondition (and (token source) (tracePointer ev6))
:effect (and (allowed) (not (token source)) (token p_3) (not (tracePointer ev6)) (tracePointer ev7))
)

(:action moveSync#data_merge#ev7
:precondition (and (token source) (tracePointer ev7))
:effect (and (allowed) (not (token source)) (token p_3) (not (tracePointer ev7)) (tracePointer ev8))
)

(:action moveInTheModel#data_merge
:precondition (token source)
:effect (and (not (allowed)) (not (token source)) (token p_3) (increase (total-cost) 1)
)
)

(:action moveSync#query#ev2
:precondition (and (token p_6) (tracePointer ev2))
:effect (and (allowed) (not (token p_6)) (token p_7) (not (tracePointer ev2)) (tracePointer ev3))
)

(:action moveSync#query#ev3
:precondition (and (token p_6) (tracePointer ev3))
:effect (and (allowed) (not (token p_6)) (token p_7) (not (tracePointer ev3)) (tracePointer ev4))
)

(:action moveInTheModel#query
:precondition (token p_6)
:effect (and (not (allowed)) (not (token p_6)) (token p_7) (increase (total-cost) 1)
)
)

(:action moveInTheModel#install_supplementary_resources
:precondition (token p_3)
:effect (and (not (allowed)) (not (token p_3)) (token p_4) (increase (total-cost) 1)
)
)

(:action moveSync#report_generated#ev10
:precondition (and (token p_7) (tracePointer ev10))
:effect (and (allowed) (not (token p_7)) (token p_8) (not (tracePointer ev10)) (tracePointer evEND))
)

(:action moveInTheModel#report_generated
:precondition (token p_7)
:effect (and (not (allowed)) (not (token p_7)) (token p_8) (increase (total-cost) 1)
)
)

(:action moveSync#request#ev1
:precondition (and (token p_8) (tracePointer ev1))
:effect (and (allowed) (not (token p_8)) (token p_11) (not (tracePointer ev1)) (tracePointer ev2))
)

(:action moveInTheModel#request
:precondition (token p_8)
:effect (and (not (allowed)) (not (token p_8)) (token p_11) (increase (total-cost) 1)
)
)

(:action moveInTheLog#request#ev1-ev2
:precondition (and (tracePointer ev1) (allowed))
:effect (and (not (tracePointer ev1)) (tracePointer ev2) (increase (total-cost) 1)
))

(:action moveInTheLog#query#ev2-ev3
:precondition (and (tracePointer ev2) (allowed))
:effect (and (not (tracePointer ev2)) (tracePointer ev3) (increase (total-cost) 1)
))

(:action moveInTheLog#query#ev3-ev4
:precondition (and (tracePointer ev3) (allowed))
:effect (and (not (tracePointer ev3)) (tracePointer ev4) (increase (total-cost) 1)
))

(:action moveInTheLog#trasformation#ev4-ev5
:precondition (and (tracePointer ev4) (allowed))
:effect (and (not (tracePointer ev4)) (tracePointer ev5) (increase (total-cost) 1)
))

(:action moveInTheLog#trasformation#ev5-ev6
:precondition (and (tracePointer ev5) (allowed))
:effect (and (not (tracePointer ev5)) (tracePointer ev6) (increase (total-cost) 1)
))

(:action moveInTheLog#data_merge#ev6-ev7
:precondition (and (tracePointer ev6) (allowed))
:effect (and (not (tracePointer ev6)) (tracePointer ev7) (increase (total-cost) 1)
))

(:action moveInTheLog#data_merge#ev7-ev8
:precondition (and (tracePointer ev7) (allowed))
:effect (and (not (tracePointer ev7)) (tracePointer ev8) (increase (total-cost) 1)
))

(:action moveInTheLog#visualization#ev8-ev9
:precondition (and (tracePointer ev8) (allowed))
:effect (and (not (tracePointer ev8)) (tracePointer ev9) (increase (total-cost) 1)
))

(:action moveInTheLog#visualization#ev9-ev10
:precondition (and (tracePointer ev9) (allowed))
:effect (and (not (tracePointer ev9)) (tracePointer ev10) (increase (total-cost) 1)
))

(:action moveInTheLog#report_generated#ev10-evEND
:precondition (and (tracePointer ev10) (allowed))
:effect (and (not (tracePointer ev10)) (tracePointer evEND) (increase (total-cost) 1)
))

)

; problem
(define (problem Align) (:domain Mining)
(:objects
source - place
sink - place
p_6 - place
p_8 - place
p_12 - place
p_14 - place
p_15 - place
p_4 - place
p_5 - place
p_3 - place
p_7 - place
p_11 - place
ev1 - event
ev2 - event
ev3 - event
ev4 - event
ev5 - event
ev6 - event
ev7 - event
ev8 - event
ev9 - event
ev10 - event
ev11 - event
ev12 - event
ev13 - event
ev14 - event
evEND - event
)
(:init
(tracePointer ev1)
(allowed)
(token source)
(= (total-cost) 0)
)
(:goal
(and
(not (token source))
(token sink)
(not (token p_6))
(not (token p_8))
(not (token p_12))
(not (token p_14))
(not (token p_15))
(not (token p_4))
(not (token p_5))
(not (token p_3))
(not (token p_7))
(not (token p_11))
(tracePointer evEND)
))
(:metric minimize (total-cost))
)

; plan
1. (moveinthelog#request#ev1-ev2)
   deleted: (tracepointer ev1)
   added: (tracepointer ev2)
   goals met: 10 of 13
2. (moveinthemodel#data_merge)
   deleted: (allowed) (token source)
   added: (token p_3)
   goals met: 10 of 13
3. (moveinthemodel#install_supplementary_resources)
   deleted: (token p_3)
   added: (token p_4)
   goals met: 10 of 13
4. (moveinthemodel#launch_algorithm)
   deleted: (token p_4)
   added: (token p_5)
   goals met: 10 of 13
5. (moveinthemodel#model_generated)
   deleted: (token p_5)
   added: (token p_6)
   goals met: 10 of 13
6. (movesync#query#ev2)
   deleted: (token p_6) (tracepointer ev2)
   added: (allowed) (token p_7) (tracepointer ev3)
   goals met: 10 of 13
7. (moveinthelog#query#ev3-ev4)
   deleted: (tracepointer ev3)
   added: (tracepointer ev4)
   goals met: 10 of 13
8. (moveinthemodel#report_generated)
   deleted: (allowed) (token p_7)
   added: (token p_8)
   goals met: 10 of 13
9. (moveinthemodel#request)
   deleted: (token p_8)
   added: (token p_11)
   goals met: 10 of 13
10. (moveinthemodel#restore_accessto_database)
   deleted: (token p_11)
   added: (token p_12)
   goals met: 10 of 13
11. (moveinthemodel#store_results)
   deleted: (token p_12)
   added: (token p_14)
   goals met: 10 of 13
12. (movesync#trasformation#ev4)
   deleted: (token p_14) (tracepointer ev4)
   added: (allowed) (token p_15) (tracepointer ev5)
   goals met: 10 of 13
13. (moveinthelog#trasformation#ev5-ev6)
   deleted: (tracepointer ev5)
   added: (tracepointer ev6)
   goals met: 10 of 13
14. (moveinthelog#data_merge#ev6-ev7)
   deleted: (tracepointer ev6)
   added: (tracepointer ev7)
   goals met: 10 of 13
15. (moveinthelog#data_merge#ev7-ev8)
   deleted: (tracepointer ev7)
   added: (tracepointer ev8)
   goals met: 10 of 13
16. (movesync#visualization#ev8)
   deleted: (token p_15) (tracepointer ev8)
   added: (token sink) (tracepointer ev9)
   goals met: 12 of 13
17. (moveinthelog#visualization#ev9-ev10)
   deleted: (tracepointer ev9)
   added: (tracepointer ev10)
   goals met: 12 of 13
18. (moveinthelog#report_generated#ev10-evend)
   deleted: (tracepointer ev10)
   added: (tracepointer evend)
   goals met: 13 of 13
